app/controllers/tasks_controller.rb

  def create
    @task = @task_list.tasks.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("body", "created_at", "task_list_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "eat food!"], ["created_at", Mon, 18 Aug 2014 04:39:06 UTC +00:00], ["task_list_id", 3], ["title", "eat"], ["updated_at", Mon, 18 Aug 2014 04:39:06 UTC +00:00]]

  def update
    if params[:completed]
      @task.update_attribute(:complete, true)
---
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 13  [["complete", true], ["updated_at", Fri, 22 Aug 2014 20:47:43 UTC +00:00]]

  def set_task_list
    @task_list = TaskList.find(params[:task_list_id])
---
SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", "4"]]

  def set_task
    @task = @task_list.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_list_id" = ? AND "tasks"."id" = ? LIMIT 1  [["task_list_id", 4], ["id", "13"]]