app/controllers/task_lists_controller.rb

SELECT "task_lists".* FROM "task_lists"
---
  def index
    @task_lists = TaskList.all

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @task_list = TaskList.find(params[:id])

INSERT INTO "task_lists" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 15 Aug 2014 21:36:12 UTC +00:00], ["name", "My task list"], ["updated_at", Fri, 15 Aug 2014 21:36:12 UTC +00:00], ["user_id", 1]]
---
  def create
    @task_list = TaskList.new(task_list_params)
    @task_list.user = current_user

    respond_to do |format|
      if @task_list.save

UPDATE "task_lists" SET "name" = ?, "updated_at" = ? WHERE "task_lists"."id" = 4  [["name", "Awesome-o's"], ["updated_at", Mon, 18 Aug 2014 04:17:37 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @task_list.update(task_list_params)

DELETE FROM "task_lists" WHERE "task_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @task_list.destroy

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", "4"]]
---
    def set_task_list
      @task_list = TaskList.find(params[:id])