app/views/task_lists/show.html.erb

  <strong>Tasks</strong>
  <% @task_list.tasks.each do |t| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_list_id" = ? AND (complete is NULL or complete = 'f')  [["task_list_id", 4]]